fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Адрес = Параметры.КлючДанных;
    
    Если Адрес <> Неопределено  Тогда
        ОтпускаСотрудников.Загрузить(ПолучитьИзВременногоХранилища(Параметры.КлючДанных));
    КонецЕсли;
    
    Для Каждого Строка Из ОтпускаСотрудников Цикл
    	
    	ТочкаДГ = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
    	СерияДГ = ДиаграммаГанта.УстановитьСерию("Отпуск");
       
    	Значение = ДиаграммаГанта.ПолучитьЗначение(ТочкаДГ, СерияДГ);
    	
    	Интервал = Значение.Добавить();
    	Интервал.Начало = Строка.ДатаНачала;
    	Интервал.Конец = Строка.ДатаОкончания;
    	
    КонецЦикла;
ДиаграммаГанта.Обновление = Истина;
КонецПроцедуры
#КонецОбласти
